artillery/artillery.yaml
config:
  target: "http://application:4777"
  phases:
    - duration: 15
      arrivalRate: 1
      name: "Warming up"
    - duration: 15
      arrivalRate: 1
      rampTo: 2
      name: "Ramping up"
    - duration: 60
      arrivalRate: 1
      name: "Sustained load"
  processor: "./processor.cjs"
 
scenarios:
  - name: "Finish order flow"
    flow:
      - post:
          url: "/finishOrder"
          beforeRequest: generateOrderData
          json:
            totalPrice: "{{ totalPrice }}"